<#import "parts/common.ftl" as c>
<@c.page>
<h5 class="card-title">Введение</h5>
<div class="card">
    <div class="card-body">
        Spring Boot позволяет легко создавать автономные, производственные Spring-приложения,
        которые вы можете "просто запустить".

        Мы принимаем взвешенное мнение о платформе Spring и сторонних библиотеках, чтобы вы могли
        начать работу с минимальными усилиями. Большинству приложений Spring Boot требуется очень
        небольшая конфигурация Spring.
    </div>
</div>
<h5 class="card-title">Возможности</h5>
<div class="card">
    <div class="card-body">
        <ol class="list-counter-circle">
            <li>Создание полноценных Spring приложений</li>
            <li>Встроенный Tomcat или Jetty (не требуется установки WAR файлов)</li>
            <li>Обеспечивает 'начальные' POMs для упрощения вашей Maven конфигурации</li>
            <li>  Автоматическая конфигурирация Spring когда это возможно</li>
            <li>Обеспечивает такими возможностями, как метрики, мониторинг состояниями и расширенная конфигурация</li>
            <li>Абсолютно без генерации кода и без написания XML конфигурация</li>
        </ol>
    </div>
</div>

</@c.page>